app/Controllers/Admin/ArticleAdminController.php

    public function index()
    {
        $page    = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 20;
        $offset  = ($page - 1) * $perPage;

        $builder = $this->db->table('articles');
        $total    = $builder->countAllResults(false);
        $articles = $builder->orderBy('created_at', 'DESC')->limit($perPage, $offset)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `articles`
SELECT *
FROM `articles`
ORDER BY `created_at` DESC
 LIMIT 20