app/Controllers/Admin/ChargingAdminController.php

    public function index()
    {
        $page    = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 20;
        $offset  = ($page - 1) * $perPage;
        $city    = $this->request->getGet('city');
        $status  = $this->request->getGet('status');

        $builder = $this->db->table('charging_stations');

        if (!empty($city)) {
            $builder->where('city', $city);
        }
        if (!empty($status)) {
            $builder->where('status', $status);
        }

        $total    = $builder->countAllResults(false);
        $stations = $builder->orderBy('name', 'ASC')->limit($perPage, $offset)->get()->getResultArray();

        // Cities for filter dropdown
        $cities = $this->db->table('charging_stations')
            ->distinct()->select('city')
            ->orderBy('city', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `charging_stations`
SELECT *
FROM `charging_stations`
ORDER BY `name` ASC
 LIMIT 20
SELECT DISTINCT `city`
FROM `charging_stations`
ORDER BY `city` ASC