app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $db = db_connect();
        $today      = date('Y-m-d');
        $weekStart  = date('Y-m-d', strtotime('monday this week'));
        $monthStart = date('Y-m-01');

        $totalLeads     = $this->db->table('leads')->countAllResults();
        $leadsToday     = $this->db->table('leads')->where('DATE(created_at)', $today)->countAllResults();
        $leadsThisWeek  = $this->db->table('leads')->where('DATE(created_at) >=', $weekStart)->countAllResults();
        $leadsThisMonth = $this->db->table('leads')->where('DATE(created_at) >=', $monthStart)->countAllResults();

        $pendingQA     = $this->db->tableExists('owner_questions')
            ? $this->db->table('owner_questions')->where('is_approved', 0)->countAllResults()
            : 0;

        $totalVehicles    = $this->db->table('vehicles')->where('status !=', 'discontinued')->countAllResults();
        $publishedVehicles= $this->db->table('vehicles')->where('status', 'published')->countAllResults();
        $draftVehicles    = $this->db->table('vehicles')->where('status', 'draft')->countAllResults();
        $featuredEVs      = $this->db->table('vehicles')->where('featured', 1)->countAllResults();
        $totalBrands      = $this->db->table('brands')->countAllResults();
        $activeBrands     = $this->db->table('brands')->where('status', 'active')->countAllResults();
        $totalDealers     = $this->db->table('dealers')->countAllResults();
        $totalArticles    = $this->db->table('articles')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `leads`
SELECT COUNT(*) AS `numrows`
FROM `leads`
WHERE DATE(created_at) = '2026-06-22'
SELECT COUNT(*) AS `numrows`
FROM `leads`
WHERE DATE(created_at) >= '2026-06-22'
SELECT COUNT(*) AS `numrows`
FROM `leads`
WHERE DATE(created_at) >= '2026-06-01'
SELECT COUNT(*) AS `numrows`
FROM `vehicles`
WHERE `status` != 'discontinued'
SELECT COUNT(*) AS `numrows`
FROM `brands`
SELECT COUNT(*) AS `numrows`
FROM `dealers`
SELECT COUNT(*) AS `numrows`
FROM `articles`

            ? $this->db->table('reviews')->where('status', 'pending')->countAllResults()
            : 0;

        $recentLeads = $this->db->table('leads')
            ->select('leads.*, vehicles.name AS vehicle_name')
            ->join('vehicles', 'vehicles.id = leads.vehicle_id', 'left')
            ->orderBy('leads.created_at', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT `leads`.*, `vehicles`.`name` AS `vehicle_name`
FROM `leads`
LEFT JOIN `vehicles` ON `vehicles`.`id` = `leads`.`vehicle_id`
ORDER BY `leads`.`created_at` DESC
 LIMIT 10