app/Controllers/Admin/DealerAdminController.php

    public function index()
    {
        $page    = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 20;
        $offset  = ($page - 1) * $perPage;
        $city    = $this->request->getGet('city');

        $builder = $this->db->table('dealers d')
            ->select('d.*');

        if (!empty($city)) {
            $builder->where('d.city', $city);
        }

        $total   = $builder->countAllResults(false);
        $dealers = $builder->orderBy('d.name', 'ASC')->limit($perPage, $offset)->get()->getResultArray();

        // City list for filter dropdown
        $cities = $this->db->table('dealers')
            ->distinct()->select('city')
            ->orderBy('city', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `dealers` `d`
SELECT `d`.*
FROM `dealers` `d`
ORDER BY `d`.`name` ASC
 LIMIT 20
SELECT DISTINCT `city`
FROM `dealers`
ORDER BY `city` ASC