app/Controllers/Admin/LeadAdminController.php

    public function index()
    {
        $page    = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 30;
        $offset  = ($page - 1) * $perPage;

        $builder = $this->db->table('leads l')
            ->select('l.*, v.name AS vehicle_name')
            ->join('vehicles v', 'v.id = l.vehicle_id', 'left');

        $this->applyFilters($builder);

        $total = $builder->countAllResults(false);
        $leads = $builder->orderBy('l.created_at', 'DESC')->limit($perPage, $offset)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `leads` `l`
LEFT JOIN `vehicles` `v` ON `v`.`id` = `l`.`vehicle_id`
SELECT `l`.*, `v`.`name` AS `vehicle_name`
FROM `leads` `l`
LEFT JOIN `vehicles` `v` ON `v`.`id` = `l`.`vehicle_id`
ORDER BY `l`.`created_at` DESC
 LIMIT 30