app/Controllers/Admin/VehicleAdminController.php

    public function index()
    {
        $search = $this->request->getGet('search');
        $page   = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 20;
        $offset  = ($page - 1) * $perPage;

        $builder = $this->db->table('vehicles v')
            ->select('v.*, b.name AS brand_name, c.name AS category_name')
            ->join('brands b', 'b.id = v.brand_id', 'left')
            ->join('vehicle_categories c', 'c.id = v.category_id', 'left');

        if (!empty($search)) {
            $builder->like('v.name', $search);
        }

        $total    = $builder->countAllResults(false);
        $vehicles = $builder->orderBy('v.created_at', 'DESC')->limit($perPage, $offset)->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `vehicles` `v`
LEFT JOIN `brands` `b` ON `b`.`id` = `v`.`brand_id`
LEFT JOIN `vehicle_categories` `c` ON `c`.`id` = `v`.`category_id`
SELECT `v`.*, `b`.`name` AS `brand_name`, `c`.`name` AS `category_name`
FROM `vehicles` `v`
LEFT JOIN `brands` `b` ON `b`.`id` = `v`.`brand_id`
LEFT JOIN `vehicle_categories` `c` ON `c`.`id` = `v`.`category_id`
ORDER BY `v`.`created_at` DESC
 LIMIT 20