app/Controllers/ArticleController.php

    public function index()
    {
        $articleModel = new ArticleModel();

        $articles = $articleModel
            ->where('status', 'published')
            ->orderBy('published_at', 'DESC')
            ->paginate(12, 'default');
---
SELECT *
FROM `articles`
WHERE `status` = 'published'
ORDER BY `published_at` DESC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `articles`
WHERE `status` = 'published'