app/Controllers/ChargingController.php

SELECT *
FROM `charging_stations`
WHERE `status` = 'operational'
ORDER BY `name` ASC
---
    public function index()
    {
        $db   = \Config\Database::connect();
        $city = trim((string) $this->request->getGet('city'));
        if (strtolower($city) === 'all') $city = '';

        // Distinct cities with at least one operational charging station,
        // sorted by real station count (most-served city first) for the city pill UI
        $cities = $db->table('charging_stations')
            ->select('city, COUNT(*) as station_count')
            ->where('status', 'operational')
            ->where('city IS NOT NULL', null, false)
            ->where('city !=', '')
            ->groupBy('city')
            ->orderBy('station_count', 'DESC')
            ->get()
            ->getResultArray();

        $query = $db->table('charging_stations')
            ->where('status', 'operational')
            ->orderBy('name', 'ASC');

        if ($city !== '') {
            $query->where('city', $city);
        }

        $stations = $query->get()->getResultArray();