app/Models/VehicleModel.php

SELECT `vehicles`.*, `brands`.`name` AS `brand_name`, `brands`.`slug` AS `brand_slug`, `brands`.`logo` AS `brand_logo`, `vehicle_categories`.`name` AS `category_name`, `vehicle_categories`.`slug` AS `category_slug`, `vehicle_categories`.`icon` AS `category_icon`
FROM `vehicles`
LEFT JOIN `brands` ON `brands`.`id` = `vehicles`.`brand_id`
LEFT JOIN `vehicle_categories` ON `vehicle_categories`.`id` = `vehicles`.`category_id`
WHERE `vehicles`.`slug` = 'ather-450x'
 LIMIT 1
---
    public function findBySlug(string $slug): ?array
    {
        $result = $this->select('vehicles.*, brands.name AS brand_name, brands.slug AS brand_slug, brands.logo AS brand_logo, vehicle_categories.name AS category_name, vehicle_categories.slug AS category_slug, vehicle_categories.icon AS category_icon')
            ->join('brands', 'brands.id = vehicles.brand_id', 'left')
            ->join('vehicle_categories', 'vehicle_categories.id = vehicles.category_id', 'left')
            ->where('vehicles.slug', $slug)
            ->first();